Config/Documents/ЗаявкаОбоснованиеЗакупкиМалогоОбъема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаОбоснованиеЗакупкиМалогоОбъема</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеВид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснованиеНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодотчетноеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РуководительПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйФинЭкономПодразделения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйКонтрактнойСлужбы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнительБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйКодЗакупки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокВыдачиДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОплатыЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗакупки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеЗакупки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗакупки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРазмещенияЗакупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыРаботыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОКПД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбщероссийскийКлассификаторПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФинансовыйГод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаличиеЛБО</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительнаяИнформация</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособОбеспечения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыОбеспеченияКомандировки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Задолженность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаПроверке</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНаПроверкеРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПросроченная</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПросроченнаяРуб</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/СоответствияАналитическихСчетовКЭК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СоответствияАналитическихСчетовКЭК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/СпособыОбеспеченияКомандировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыОбеспеченияКомандировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АвансПодотчетномуЛицу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыдачаДенежныхДокументов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Закупка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаСчетПринимающейСтороны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозмещениеПоФакту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Enums/ВидыОплатыЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыОплатыЗакупок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСчету</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Наличными</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКарте</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Documents/ЗаявкаОбоснованиеЗакупкиМалогоОбъема/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|	ПО ЭтотСписок.ПодотчетноеЛицо.Контрагент.ЮридическоеФизическоеЛицо = Пользователи.ФизическоеЛицо
	|
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)
	|	И ЗначениеРазрешено(Пользователи.Ссылка, NULL КАК ИСТИНА)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ТаблицаДенежныхОбязательствПоЗаявке(ЗаявкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Регистратор", ЗаявкаСсылка);
	Запрос.УстановитьПараметр("ВалютаРегУчета", БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета());
	Запрос.УстановитьПараметр("Счет50211", БухгалтерскийУчет.СписокСчетов("502.11, 502.21"));
	Запрос.УстановитьПараметр("Счет50212", БухгалтерскийУчет.СписокСчетов("502.12, 502.22"));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетКт В (&Счет50212)
	|					И ДвиженияССубконто.ПодразделениеКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ПодразделениеКт = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ДвиженияССубконто.ПодразделениеДт
	|		ИНАЧЕ ДвиженияССубконто.ПодразделениеКт
	|	КОНЕЦ КАК Подразделение,
	|	ДвиженияССубконто.КФО КАК КФО,
	|	ДвиженияССубконто.КПСКт КАК КПС,
	|	ДвиженияССубконто.КЭККт КАК КЭК,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ВидыЦелевыхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ КАК КодЦели,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.Мероприятия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка)
	|	КОНЕЦ КАК КодМероприятия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка)
	|	КОНЕЦ КАК ДопКлассификация,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета
	|			ТОГДА """"
	|		ИНАЧЕ ДвиженияССубконто.ВалютаКт
	|	КОНЕЦ КАК Валюта,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетКт В (&Счет50212)
	|					И (ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|						ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета)
	|				ТОГДА ДвиженияССубконто.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК Сумма,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетКт В (&Счет50212)
	|					И (ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|						ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета)
	|				ТОГДА 0
	|			ИНАЧЕ ДвиженияССубконто.ВалютнаяСуммаКт
	|		КОНЕЦ) КАК СуммаВВалюте,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетКт В (&Счет50211)
	|					И (ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|						ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета)
	|				ТОГДА ДвиженияССубконто.Сумма
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаБО,
	|	СУММА(ВЫБОР
	|			КОГДА ДвиженияССубконто.СчетКт В (&Счет50211)
	|					И (ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|						ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета)
	|				ТОГДА 0
	|			ИНАЧЕ ДвиженияССубконто.ВалютнаяСуммаКт
	|		КОНЕЦ) КАК СуммаБОВВалюте
	|ИЗ
	|	РегистрБухгалтерии.ЖурналПроводокЕПСБУ.ДвиженияССубконто(
	|			,
	|			,
	|			(СчетКт В (&Счет50211)
	|				ИЛИ СчетКт В (&Счет50212))
	|				И Регистратор В (&Регистратор),
	|			,
	|			) КАК ДвиженияССубконто
	|
	|СГРУППИРОВАТЬ ПО
	|	ДвиженияССубконто.КПСКт,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.СчетКт В (&Счет50212)
	|					И ДвиженияССубконто.ПодразделениеКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ПодразделениеКт = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|			ТОГДА ДвиженияССубконто.ПодразделениеДт
	|		ИНАЧЕ ДвиженияССубконто.ПодразделениеКт
	|	КОНЕЦ,
	|	ДвиженияССубконто.КЭККт,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ВидыЦелевыхСредств)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ВидыЦелевыхСредств)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ВидыЦелевыхСредств)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ВидыЦелевыхСредств.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.ДополнительнаяБюджетнаяКлассификация)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.ДополнительнаяБюджетнаяКлассификация)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ДополнительнаяБюджетнаяКлассификация.ПустаяСсылка)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоКт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоКт3 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт1 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт2 КАК Справочник.Мероприятия)
	|		КОГДА ТИПЗНАЧЕНИЯ(ДвиженияССубконто.СубконтоДт3) = ТИП(Справочник.Мероприятия)
	|			ТОГДА ВЫРАЗИТЬ(ДвиженияССубконто.СубконтоДт3 КАК Справочник.Мероприятия)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Мероприятия.ПустаяСсылка)
	|	КОНЕЦ,
	|	ДвиженияССубконто.КФО,
	|	ВЫБОР
	|		КОГДА ДвиженияССубконто.ВалютаКт ЕСТЬ NULL
	|				ИЛИ ДвиженияССубконто.ВалютаКт = &ВалютаРегУчета
	|			ТОГДА """"
	|		ИНАЧЕ ДвиженияССубконто.ВалютаКт
	|	КОНЕЦ";
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Функция ДанныеДляВводаВедомостиНаВыдачуДенегИзКассы(МассивСсылок) Экспорт
	
	Результат = Новый Массив;
	
	ВалютаРегУчета = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка КАК Ссылка,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка.Организация КАК Организация,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка.ИФО КАК ИФО,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка.ПодотчетноеЛицо КАК Сотрудник,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка.Подразделение КАК Подразделение,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Сумма КАК Сумма,
	|	&ВалютаРегУчета КАК Валюта,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.КФО КАК КФО,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.КПС КАК КПС,
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.КЭК КАК КЭК
	|ПОМЕСТИТЬ ТаблицаРасходов
	|ИЗ
	|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги КАК ЗаявкаОбоснованиеТоварыРаботыУслуги
	|ГДЕ
	|	ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка В(&МассивСсылок)
	|	И ЗаявкаОбоснованиеТоварыРаботыУслуги.СпособОбеспечения = ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.АвансПодотчетномуЛицу)
	|	И ЗаявкаОбоснованиеТоварыРаботыУслуги.Ссылка.ВидОплаты В (ЗНАЧЕНИЕ(Перечисление.ВидыОплатыЗакупок.Наличными), ЗНАЧЕНИЕ(Перечисление.ВидыОплатыЗакупок.ПоКарте))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаРасходов.Ссылка КАК Ссылка,
	|	ТаблицаРасходов.Организация КАК Организация,
	|	ТаблицаРасходов.ИФО КАК ИФО,
	|	ТаблицаРасходов.Сотрудник КАК Сотрудник,
	|	ТаблицаРасходов.Подразделение КАК Подразделение,
	|	СУММА(ТаблицаРасходов.Сумма) КАК Сумма,
	|	ТаблицаРасходов.Валюта КАК Валюта,
	|	ТаблицаРасходов.КФО КАК КФО,
	|	ТаблицаРасходов.КПС КАК КПС,
	|	ТаблицаРасходов.КЭК КАК КЭК
	|ПОМЕСТИТЬ ТаблицаРасходовСгруппированная
	|ИЗ
	|	ТаблицаРасходов КАК ТаблицаРасходов
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаРасходов.Ссылка,
	|	ТаблицаРасходов.Организация,
	|	ТаблицаРасходов.ИФО,
	|	ТаблицаРасходов.КЭК,
	|	ТаблицаРасходов.Сотрудник,
	|	ТаблицаРасходов.Подразделение,
	|	ТаблицаРасходов.КФО,
	|	ТаблицаРасходов.Валюта,
	|	ТаблицаРасходов.КПС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаРасходовСгруппированная.Организация КАК Организация,
	|	ТаблицаРасходовСгруппированная.Валюта КАК Валюта,
	|	ТаблицаРасходовСгруппированная.ИФО КАК ИФО,
	|	АВТОНОМЕРЗАПИСИ() КАК ИдентификаторНабора
	|ПОМЕСТИТЬ ТаблицаШапок
	|ИЗ
	|	ТаблицаРасходовСгруппированная КАК ТаблицаРасходовСгруппированная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШапок.Организация КАК Организация,
	|	ТаблицаШапок.Валюта КАК Валюта,
	|	ТаблицаШапок.ИФО КАК ИФО,
	|	ТаблицаШапок.ИдентификаторНабора КАК ИдентификаторНабора,
	|	ТаблицаРасходовСгруппированная.Ссылка КАК ДокументОснование,
	|	ТаблицаРасходовСгруппированная.Сотрудник КАК Сотрудник,
	|	ТаблицаРасходовСгруппированная.Подразделение КАК ПодразделениеКор,
	|	ТаблицаРасходовСгруппированная.Сумма КАК Сумма,
	|	ТаблицаРасходовСгруппированная.КФО КАК КФО,
	|	ТаблицаРасходовСгруппированная.КПС КАК КПС,
	|	ТаблицаРасходовСгруппированная.КЭК КАК КЭК,
	|	СоответствияАналитическихСчетовКЭК.Счет КАК КорСчет
	|ИЗ
	|	ТаблицаШапок КАК ТаблицаШапок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаРасходовСгруппированная КАК ТаблицаРасходовСгруппированная
	|		ПО ТаблицаШапок.Организация = ТаблицаРасходовСгруппированная.Организация
	|			И ТаблицаШапок.Валюта = ТаблицаРасходовСгруппированная.Валюта
	|			И ТаблицаШапок.ИФО = ТаблицаРасходовСгруппированная.ИФО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияАналитическихСчетовКЭК КАК СоответствияАналитическихСчетовКЭК
	|		ПО (ТаблицаРасходовСгруппированная.КЭК = СоответствияАналитическихСчетовКЭК.КЭК)
	|			И (СоответствияАналитическихСчетовКЭК.Счет В (&Счет208))
	|			И (НЕ СоответствияАналитическихСчетовКЭК.Счет.ЭлементГруппа)
	|ИТОГИ
	|	МАКСИМУМ(Организация),
	|	МАКСИМУМ(Валюта),
	|	МАКСИМУМ(ИФО),
	|	СУММА(Сумма)
	|ПО
	|	ИдентификаторНабора";
	
	Запрос.УстановитьПараметр("ВалютаРегУчета", ВалютаРегУчета);
	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	Запрос.УстановитьПараметр("Счет208",
		БухгалтерскийУчет.СписокСчетов("208.00", Новый Граница(МассивСсылок[0].МоментВремени())));
	
	ВыборкаШапка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		Ведомость = Новый Структура;
		Ведомость.Вставить("Организация", ВыборкаШапка.Организация);
		Ведомость.Вставить("Валюта", ВыборкаШапка.Валюта);
		Ведомость.Вставить("ИФО", ВыборкаШапка.ИФО);
		Ведомость.Вставить("Ключ", Строка(ВыборкаШапка.Организация) + Строка(ВыборкаШапка.Валюта) + Строка(ВыборкаШапка.ИФО));
		
		ВедомостьТЧ = Новый Массив;
		ВыборкаСтроки = ВыборкаШапка.Выбрать();
		Пока ВыборкаСтроки.Следующий() Цикл
			СтрокаТЧ = Новый Структура;
			СтрокаТЧ.Вставить("Сотрудник", ВыборкаСтроки.Сотрудник);
			СтрокаТЧ.Вставить("ДокументОснование", ВыборкаСтроки.ДокументОснование);
			СтрокаТЧ.Вставить("КорСчет", ВыборкаСтроки.КорСчет);
			СтрокаТЧ.Вставить("ПодразделениеКор", ВыборкаСтроки.ПодразделениеКор);
			СтрокаТЧ.Вставить("КФО", ВыборкаСтроки.КФО);
			СтрокаТЧ.Вставить("КПС", ВыборкаСтроки.КПС);
			СтрокаТЧ.Вставить("КЭК", ВыборкаСтроки.КЭК);
			СтрокаТЧ.Вставить("Сумма", ВыборкаСтроки.Сумма);
			ВедомостьТЧ.Добавить(СтрокаТЧ);
		КонецЦикла;
		Ведомость.Вставить("РасшифровкаПлатежа", ВедомостьТЧ);
		
		Результат.Добавить(Ведомость);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.МенеджерПечати = "Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема";
	КомандаПечати.Идентификатор = "ПФ_MXL_ЗаявкаОбоснованиеЗакупкиМалогоОбъема";
	КомандаПечати.Представление = НСтр("ru = 'Заявка-обоснование закупки малого объема'");
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗаявкаОбоснованиеЗакупкиМалогоОбъема") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ЗаявкаОбоснованиеЗакупкиМалогоОбъема",
			"Заявка-обоснование закупки малого объема",
			ПечатьЗаявкиОбоснованияЗакупкиМалогоОбъема(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПечатьЗаявкиОбоснованияЗакупкиМалогоОбъема(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.ИмяПараметровПечати = "ПараметрыПечати_ЗаявкаОбоснованиеЗакупкиМалогоОбъема";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ПФ_MXL_ЗаявкаОбоснованиеЗакупкиМалогоОбъема");
	
	ОбластьЗаголовок 								= Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаФинансовоеОбоснование 				= Макет.ПолучитьОбласть("СтрокаФинансовоеОбоснование");
	ОбластьИтогоФинансовоеОбоснование 				= Макет.ПолучитьОбласть("ИтогоФинансовоеОбоснование");
	ОбластьПодвалФинансовоеОбоснование 				= Макет.ПолучитьОбласть("ПодвалФинансовоеОбоснование");
	ОбластьШапкаСведенияОМалойЗакупке 				= Макет.ПолучитьОбласть("ШапкаСведенияОМалойЗакупке");
	ОбластьШапкаПодотчетноеЛицо 					= Макет.ПолучитьОбласть("ШапкаПодотчетноеЛицо");
	ОбластьСтрокаЗадолженностьВсегоПервая 			= Макет.ПолучитьОбласть("СтрокаЗадолженностьВсегоПервая");
	ОбластьСтрокаЗадолженностьВсего 				= Макет.ПолучитьОбласть("СтрокаЗадолженностьВсего");
	ОбластьСтрокаЗадолженностьНаПроверкеПервая 		= Макет.ПолучитьОбласть("СтрокаЗадолженностьНаПроверкеПервая");
	ОбластьСтрокаЗадолженностьНаПроверке 			= Макет.ПолучитьОбласть("СтрокаЗадолженностьНаПроверке");
	ОбластьСтрокаЗадолженностьПросроченнаяПервая 	= Макет.ПолучитьОбласть("СтрокаЗадолженностьПросроченнаяПервая");
	ОбластьСтрокаЗадолженностьПросроченная 			= Макет.ПолучитьОбласть("СтрокаЗадолженностьПросроченная");
	ОбластьПодвалЗадолженность 						= Макет.ПолучитьОбласть("ПодвалЗадолженность");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка КАК Ссылка,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Номер КАК Номер,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Дата КАК Дата,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.НаименованиеПолное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.НаименованиеСокращенное = """"
	|						ТОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.Наименование
	|					ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.НаименованиеСокращенное
	|				КОНЕЦ
	|		ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.НаименованиеПолное
	|	КОНЕЦ КАК НаименованиеОрганизации,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Организация.КодПоРПБС КАК КодПоСводномуРееструОрганизации,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Подразделение КАК Подразделение,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Подразделение.Наименование КАК СтруктурноеПодразделение,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Подразделение.Код КАК КодСтруктурногоПодразделения,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ДокументОснованиеВид КАК ДокументОснованиеВид,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ДокументОснованиеДата КАК ДокументОснованиеДата,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ДокументОснованиеНомер КАК ДокументОснованиеНомер,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ПодотчетноеЛицо КАК ПодотчетноеЛицо,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ПодотчетноеЛицо.Код КАК ТабельныйНомер,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Руководитель КАК Руководитель,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.РуководительПодразделения КАК РуководительПодразделения,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ответственный КАК Ответственный,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ОтветственныйИсполнительБух КАК ОтветственныйИсполнительБух,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ОтветственныйКонтрактнойСлужбы КАК ОтветственныйКонтрактнойСлужбы,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ОтветственныйФинЭкономПодразделения КАК ОтветственныйФинЭкономПодразделения,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ИдентификационныйКодЗакупки КАК ИдентификационныйКодЗакупки,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.СрокВыдачиДней КАК СрокВыдачиДней,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ВидОплаты КАК ВидОплаты,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.СтатусЗакупки КАК СтатусЗакупки,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.НаименованиеЗакупки КАК НаименованиеЗакупки,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.НомерЗакупки КАК НомерЗакупки,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ДатаРазмещенияЗакупки КАК ДатаРазмещенияЗакупки,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Договор КАК Договор,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Договор.ДатаДоговора КАК ДатаДоговора,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Договор.НомерДоговора КАК НомерДоговора,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Комментарий КАК Комментарий,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Номенклатура.НаименованиеПолное = """"
	|				ТОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Номенклатура.Наименование
	|			ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Номенклатура.НаименованиеПолное
	|		КОНЕЦ КАК НоменклатураПредставление,
	|		(ВЫРАЗИТЬ(ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.ОКПД.НаименованиеПолное КАК СТРОКА(1024))) + "" ("" + ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.ОКПД.Код + "")"" КАК ОКПДПредставление,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.СпособОбеспечения = ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов)
	|				ТОГДА """"
	|			ИНАЧЕ ПРЕДСТАВЛЕНИЕ(ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.ЕдиницаИзмерения)
	|		КОНЕЦ КАК ЕдиницаИзмерения,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.СпособОбеспечения = ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов)
	|				ТОГДА 0
	|			ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Количество
	|		КОНЕЦ КАК Количество,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.СпособОбеспечения = ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов)
	|				ТОГДА 0
	|			ИНАЧЕ ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.Цена
	|		КОНЕЦ КАК Цена,
	|		Сумма КАК Сумма,
	|		ФинансовыйГод КАК ФинансовыйГод,
	|		КФО КАК КФО,
	|		ЕстьNULL(Ссылка.Организация.КодПоППП.Код, ""000"") + КПС.Код КАК КБК,
	|		КЭК КАК КОСГУ,
	|		ВЫБОР
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.СпособОбеспечения = ЗНАЧЕНИЕ(Перечисление.СпособыОбеспеченияКомандировки.ВыдачаДенежныхДокументов)
	|				ТОГДА """"
	|			КОГДА ЗаявкаОбоснованиеЗакупкиМалогоОбъема.ТоварыРаботыУслуги.НаличиеЛБО
	|				ТОГДА ""есть""
	|			ИНАЧЕ ""нет""
	|		КОНЕЦ КАК НаличиеЛБО,
	|		ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|	) КАК ТоварыРаботыУслуги,
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Задолженность.(
	|		Ссылка КАК Ссылка,
	|		НомерСтроки КАК НомерСтроки,
	|		Валюта КАК Валюта,
	|		Валюта.Код КАК ВалютаКод,
	|		Сумма КАК Сумма,
	|		СуммаРуб КАК СуммаРуб,
	|		СуммаНаПроверке КАК СуммаНаПроверке,
	|		СуммаНаПроверкеРуб КАК СуммаНаПроверкеРуб,
	|		СуммаПросроченная КАК СуммаПросроченная,
	|		СуммаПросроченнаяРуб КАК СуммаПросроченнаяРуб
	|	) КАК Задолженность
	|ИЗ
	|	Документ.ЗаявкаОбоснованиеЗакупкиМалогоОбъема КАК ЗаявкаОбоснованиеЗакупкиМалогоОбъема
	|ГДЕ
	|	ЗаявкаОбоснованиеЗакупкиМалогоОбъема.Ссылка В(&МассивОбъектов)";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока Выборка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		СтруктураДанных = Новый Структура;
		Для Каждого Колонка ИЗ РезультатЗапроса.Колонки Цикл
			СтруктураДанных.Вставить(Колонка.Имя, Выборка[Колонка.Имя]);
		КонецЦикла;
		
		Сотрудники = Новый Массив;
		Сотрудники.Добавить(СтруктураДанных.ПодотчетноеЛицо);
		Сотрудники.Добавить(СтруктураДанных.Руководитель);
		Сотрудники.Добавить(СтруктураДанных.РуководительПодразделения);
		Сотрудники.Добавить(СтруктураДанных.ОтветственныйФинЭкономПодразделения);
		Сотрудники.Добавить(СтруктураДанных.ОтветственныйКонтрактнойСлужбы);
		Сотрудники.Добавить(СтруктураДанных.ОтветственныйИсполнительБух);
		
		ТребуемыеДанные = Новый Массив;
		ТребуемыеДанные.Добавить("Фамилия");
		ТребуемыеДанные.Добавить("Имя");
		ТребуемыеДанные.Добавить("Отчество");
		ТребуемыеДанные.Добавить("Должность");
		
		ДанныеСотрудников = Справочники.Сотрудники.ПолучитьДанныеСотрудников(Сотрудники, ТребуемыеДанные, СтруктураДанных.Дата);
		
		СтруктрураФИО = Новый Структура;
		
		Если ЗначениеЗаполнено(СтруктураДанных.ПодотчетноеЛицо) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.ПодотчетноеЛицо, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("СотрудникФамилия", 			ДанныеСотрудника.Фамилия);
			СтруктураДанных.Вставить("СотрудникИмя", 				ДанныеСотрудника.Имя);
			СтруктураДанных.Вставить("СотрудникОтчество", 			ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("СотрудникДолжность", 			ДанныеСотрудника.ДолжностьНаименование);
			СтруктураДанных.Вставить("СотрудникИнициалыФамилия", 	КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.Руководитель) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.Руководитель, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("РуководительИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
			СтруктураДанных.Вставить("РуководительДолжность", ДанныеСотрудника.ДолжностьНаименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.РуководительПодразделения) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.РуководительПодразделения, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("РуководительПодразделенияИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
			СтруктураДанных.Вставить("РуководительПодразделенияДолжность", ДанныеСотрудника.ДолжностьНаименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОтветственныйФинЭкономПодразделения) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.ОтветственныйФинЭкономПодразделения, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("ОтветственныйФЭПИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
			СтруктураДанных.Вставить("ОтветственныйФЭПДолжность", ДанныеСотрудника.ДолжностьНаименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОтветственныйКонтрактнойСлужбы) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.ОтветственныйКонтрактнойСлужбы, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("ОтветственныйКонтрактнойСлужбыИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
			СтруктураДанных.Вставить("ОтветственныйКонтрактнойСлужбыДолжность", ДанныеСотрудника.ДолжностьНаименование);
		КонецЕсли;
		Если ЗначениеЗаполнено(СтруктураДанных.ОтветственныйИсполнительБух) Тогда
			ДанныеСотрудника = ДанныеСотрудников.Найти(СтруктураДанных.ОтветственныйИсполнительБух, "Ссылка");
			СтруктрураФИО.Вставить("Фамилия", 	ДанныеСотрудника.Фамилия);
			СтруктрураФИО.Вставить("Имя", 		ДанныеСотрудника.Имя);
			СтруктрураФИО.Вставить("Отчество", 	ДанныеСотрудника.Отчество);
			СтруктураДанных.Вставить("ОтветственныйИсполнительБухИнициалыФамилия", КорреспондентыКлиентСервер.ФИО(СтруктрураФИО, Истина));
			СтруктураДанных.Вставить("ОтветственныйИсполнительБухДолжность", ДанныеСотрудника.ДолжностьНаименование);
		КонецЕсли;
		
		СтруктураДаты = ПлатежноРасчетныеДокументы.РазложитьДатуДляПечати(СтруктураДанных.Дата);
		СтруктураДанных.Вставить("ЧислоДаты", 	СтруктураДаты.Число);
		СтруктураДанных.Вставить("МесяцДаты", 	СтруктураДаты.Месяц);
		СтруктураДанных.Вставить("ГодДаты", 	СтруктураДаты.Год);
		
		СтруктураДанных.Номер = ОбщегоНазначенияБГУ.ПолучитьНомерДляПечатиПоНастройке(СтруктураДанных.Ссылка, СтруктураДанных.Номер);
		
		ОбластьЗаголовок.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		
		ИтогоСумма = 0;
		
		СтрокиФинансовоеОбоснование = СтруктураДанных.ТоварыРаботыУслуги.Выбрать();
		Пока СтрокиФинансовоеОбоснование.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(ОбластьСтрокаФинансовоеОбоснование.Параметры, СтрокиФинансовоеОбоснование);
			ТабличныйДокумент.Вывести(ОбластьСтрокаФинансовоеОбоснование);
			ИтогоСумма = ИтогоСумма + СтрокиФинансовоеОбоснование.Сумма;
		КонецЦикла;
		
		ОбластьИтогоФинансовоеОбоснование.Параметры.ИтогоСумма = ИтогоСумма;
		ТабличныйДокумент.Вывести(ОбластьИтогоФинансовоеОбоснование);
		
		ОбластьПодвалФинансовоеОбоснование.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(ОбластьПодвалФинансовоеОбоснование);
		
		ОбластьШапкаСведенияОМалойЗакупке.Параметры.Заполнить(СтруктураДанных);
		ТабличныйДокумент.Вывести(ОбластьШапкаСведенияОМалойЗакупке);
		
		// Страница 2 выводится только при оплате через подотчетное лицо
		ОплатаЧерезПодотчетноеЛицо = СтруктураДанных.ВидОплаты <> ПредопределенноеЗначение("Перечисление.ВидыОплатыЗакупок.ПоСчету");
		
		Если ОплатаЧерезПодотчетноеЛицо Тогда
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ОбластьШапкаПодотчетноеЛицо.Параметры.Заполнить(СтруктураДанных);
			ТабличныйДокумент.Вывести(ОбластьШапкаПодотчетноеЛицо);
			
			СтрокиЗадолженность = СтруктураДанных.Задолженность.Выбрать();
			
			Если СтрокиЗадолженность.Количество() = 0 Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрокаЗадолженностьВсегоПервая);
				ТабличныйДокумент.Вывести(ОбластьСтрокаЗадолженностьНаПроверкеПервая);
				ТабличныйДокумент.Вывести(ОбластьСтрокаЗадолженностьПросроченнаяПервая);
			КонецЕсли;
			
			НомерОбхода = 0;
			Пока НомерОбхода < 3 Цикл
				НомерОбхода = НомерОбхода + 1;
				Пока СтрокиЗадолженность.Следующий() Цикл
					Если НомерОбхода = 1 Тогда
						ОбластьЗадолженность = ?(СтрокиЗадолженность.НомерСтроки = 1, ОбластьСтрокаЗадолженностьВсегоПервая, ОбластьСтрокаЗадолженностьВсего);
						ОбластьЗадолженность.Параметры.ВалютаКод = СтрокиЗадолженность.ВалютаКод;
						Если СтрокиЗадолженность.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
							ОбластьЗадолженность.Параметры.СуммаВал = 0;
						Иначе
							ОбластьЗадолженность.Параметры.СуммаВал = СтрокиЗадолженность.Сумма;
						КонецЕсли;
						ОбластьЗадолженность.Параметры.Сумма = СтрокиЗадолженность.СуммаРуб;
						ТабличныйДокумент.Вывести(ОбластьЗадолженность);
					ИначеЕсли НомерОбхода = 2 И СтрокиЗадолженность.СуммаНаПроверкеРуб <> 0 Тогда
						ОбластьЗадолженность = ?(СтрокиЗадолженность.НомерСтроки = 1, ОбластьСтрокаЗадолженностьНаПроверкеПервая, ОбластьСтрокаЗадолженностьНаПроверке);
						ОбластьЗадолженность.Параметры.ВалютаКод = СтрокиЗадолженность.ВалютаКод;
						Если СтрокиЗадолженность.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
							ОбластьЗадолженность.Параметры.СуммаВал = 0;
						Иначе
							ОбластьЗадолженность.Параметры.СуммаВал = СтрокиЗадолженность.СуммаНаПроверке;
						КонецЕсли;
						ОбластьЗадолженность.Параметры.Сумма = СтрокиЗадолженность.СуммаНаПроверкеРуб;
						ТабличныйДокумент.Вывести(ОбластьЗадолженность);
					ИначеЕсли НомерОбхода = 3 И СтрокиЗадолженность.СуммаПросроченнаяРуб <> 0 Тогда
						ОбластьЗадолженность = ?(СтрокиЗадолженность.НомерСтроки = 1, ОбластьСтрокаЗадолженностьПросроченнаяПервая, ОбластьСтрокаЗадолженностьПросроченная);
						ОбластьЗадолженность.Параметры.ВалютаКод = СтрокиЗадолженность.ВалютаКод;
						Если СтрокиЗадолженность.Валюта = БухгалтерскийУчетПовтИсп.ВалютаРегламентированногоУчета() Тогда
							ОбластьЗадолженность.Параметры.СуммаВал = 0;
						Иначе
							ОбластьЗадолженность.Параметры.СуммаВал = СтрокиЗадолженность.СуммаПросроченная;
						КонецЕсли;
						ОбластьЗадолженность.Параметры.Сумма = СтрокиЗадолженность.СуммаПросроченнаяРуб;
						ТабличныйДокумент.Вывести(ОбластьЗадолженность);
					КонецЕсли;
				КонецЦикла;
				СтрокиЗадолженность.Сбросить();
			КонецЦикла;
			
			ОбластьПодвалЗадолженность.Параметры.Заполнить(СтруктураДанных);
			ТабличныйДокумент.Вывести(ОбластьПодвалЗадолженность);
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
